{
    "info": {
        "name": "Gabriel Carrasco",
        "title": "Software Engineer",
        "email": "gabrielhcarrascod@gmail.com"
    },
    "summary": {
        "profesional":"Backend developer with experience with agile projects. Focused on the enhancement, support and maintenance of microservices used for inventory, retail and pharmaceutical records. Basic experience of CI/CD focused on the deployment, testing and monitoring in multiple environments and services."
    },
    "technical" : {
        "skills" : [
            "Knowledge of Java and SpringBoot",
            "Experience with SQL and Non-SQL type databases.",
            "Basic Knowledge on CI/CD tools and process",
            "Experience on containers with Docker",
            "Data analysis for troubleshooting in microservices",
            "Experience with retail and inventory systems.",
            "Knowledge scripting with Python",
            "Basic Knowledge of C/C++, Rust and Bash"
        ],
        "stack" : [
            "Java",
            "SpringBoot", 
            "C/C++", 
            "Docker", 
            "Kubernetes", 
            "Python", 
            "Bash", 
            "Kotlin", 
            "PLSQL",
            "JDK", 
            "Maven", 
            "Postman", 
            "Jenkins", 
            "Elastic Search", 
            "Dynatrace", 
            "New Relic", 
            "PCF", 
            "OpenShift", 
            "JUnit",
            "Mockito", 
            "Linux(Ubuntu/linux-server)/Unix", 
            "Kafka", 
            "Oracle", 
            "MySQL", 
            "MongoDB", 
            "Qt"
        ],
        "methodologies" : [
            "SCRUM"
        ]
    },
    "jobs" : [
        {
            "id": 1,
            "contractor": "AgileThought",
            "client": "Cigna",
            "subtitle": "Java Developer",
            "years": "Dec 2022 – April 2025",
            "quickSummary" : "Java and SprinBoot developer, providing support to multiple environments code as well as infraestructure techonologies updates and enhancements",
            "description": "Enhancement developer for Java/SpringBoot microservices. Service upgrades and migrations in technologies used along the software life cycle. Usage and user-end configuration of Docker/Kubernetes for service deployment and scaling across multiple environments hosted in OpenShift. PL SQL analysis of Java logic migration. Low environment functionality testing. Service monitoring with New Relic and Splunk. Linux/Unix usage for application hosting and analysis/maintenance.Enhancement developer for Java/SpringBoot microservices. Service upgrades and migrations in technologies used along the software life cycle. Usage and user-end configuration of Docker/Kubernetes for service deployment and scaling across multiple environments hosted in OpenShift. PL SQL analysis of Java logic migration. Low environment functionality testing. Service monitoring with New Relic and Splunk. Linux/Unix usage for application hosting and analysis/maintenance."
        },
        {   "id": 2,
            "contractor": "AgileThought",
            "client": "AutoZone",
            "subtitle": "Java Developer",
            "years": "April 2021 – Nov 2022",
            "quickSummary" : "Mainteining and enhancing Java API. Providing releases to all environments as well as multi team support to related services.",
            "description": "Java/SpringBoot developer in REST microservices. Maintaining code through enhancements and fixing functionality issues. Providing support to troubleshoot PROD incidents in real time, collaborating with multiple teams to stabilize and fix issues in multiple environments. DevOps support focused on deployment and releases. PROD and low-env deployments with Jenkins. Data analysis with Python and Excel. Analysis of retails systems with Elastic, Dynatrace and PCF."
        },
        {   "id": 3,
            "contractor": "AgileThought",
            "client": "AutoZone",
            "subtitle": "C/C++ Developer",
            "years": "Oct 2020 – April 2021",
            "quickSummary" : "C/C++ development of retailing system. Low env testing and troubleshooting.",
            "description": "Troubleshooting and maintenance of retail and inventory systems with C/C++ and Qt. Usage of Docker for building and running services. Analysis of the retail system. Troubleshooting and development in Linux/Unix based environment."
        },
        {   "id": 4,
            "contractor": "AgileThought",
            "client": "Intership",
            "subtitle": "Java Developer",
            "years": "Feb 2020 – Aug 2020",
            "quickSummary" : "API development with Java and NonSQL database management.",
            "description": "REST API developer with Java and SpringBoot. MongoDB setup and usage. Unit testing with JUnit and Mockito. APIs validation."
        }
    ],
    "games": [
        {
            "gameName": "Untitled",
            "platform": "PC",
            "githubLink" : "https://github.com/Gabrielhcd/UECourse",
            "bShipped": false,
            "images" : [
                
            ],
            "video": "../../../public/UECourseShort.mov",
            "defaultImg": "./typing-typing-furiously.gif",
            "quickSummary": "Simple action style game. Where you play as Dummy and try to kill the enemies on the desert land",
            "description": "Begginers UE5 project from Udemy. Focused on the general tools and good practices from the editor and code alike. The project objective was to create a third person action style game and learning the basics of the editor and C++ framework. Since the point of making the the game was to learn UE5 I tried to take it slowly and research parts of editor more in deep for better understanding. Of course, since UE is its own monster (besides C++ and the UE-Framework) to be able to complete the project I mostly focus on making what the project suggested and just researching and do stuff in their own separated projects.",
            "learning": "I learn a lot. But the key things that I got from this were how to use the C++ framework to create Base classes to them use them as BPs. How Animations (AnimMontages, AnimBPs, ThreadSafe, Notifys) work and make the game feel realistic. And something that I enjoyed was leveling(making the level) for landscaping and prototyping with the modeling tool and basic shapes, it does help a lot to have the basic structure of the map while testing features.",
            "stack": "UE-5.2, Blender, Git",
            "technologies": [
                "UE-5.2",
                "Blender-4.1",
                "Git"
            ],
            "assets": ""
        },
        {
            "gameName": "Untitled",
            "platform": "PC",
            "githubLink" : "https://github.com/Gabrielhcd/GASCourse",
            "bShipped": false,
            "images" : [
                
            ],
            "video": "../../../public/GASCourseShort.mov",
            "defaultImg": "./typing-typing-furiously.gif",
            "quickSummary": "Simple mechanic game to to play online using GAS",
            "description": "Introductory project to GAS. Using current mainly Paragon assets to learn how does GAS work. The game is a third person moba style game. Using the character Bear from the Fab and assigning 2 abilities(GameplayAbilities) and 2 enemies that can take and do damage. The enemies are for melee and range damage. Each with the same basic abilities but different usage for both to fit the type of attack better.",
            "learning": "It is quite interesting (from a programmer standpoint) how GAS makes some of the work easier. Using the abilities and effects from the system makes pretty simple to use replication to get a good base online experience. Of course that even on a basic level it depends on how it is managed(the montage playing, the replication type, how events are handled and validated) it does provides a goodo entry point to make an online game.",
            "stack": "UE-5.6, Blender, Git",
            "technologies": [
                "UE-5.6",
                "Blender-4.1",
                "Perforce",
                "Git"
            ],
            "assets": ""
        }
    ],
    "education": {
        "university": "Universidad de Colima",
        "title": "Software Engineer",
        "years": "2017 - 2021"
    }
}